In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\hanis'

In [4]:
import pandas as pd

In [5]:
pd.read_excel(r'myproject.xlsx')

      name  number   place
0    sunil  898989  guntur
1  hanisha  898989  tenali

In [6]:
pd.read_csv(r'myproject2.csv')

    name   number organasation
0     sri   89895       vignan
1  mukesh   89856       vignan
2    mani  878785      bashyam

In [9]:
import pandas as pd

In [11]:
pd.read_csv(r'myproject.tsv',sep='\t')

       name number class place
0    sunil 898985 inter guntur
1  hanisha 87875 degree tenali
2     manasa 852852 pg chennai